# DimensionSegmentArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegmentArrayIterator Class
Members See Also
---
An iterator to an array of DimensionSegment objects..
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class DimensionSegmentArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class DimensionSegmentArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class DimensionSegmentArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DimensionSegmentArrayIterator
# See Also
DimensionSegmentArrayIterator Members
Autodesk.Revit.DB Namespace